DataBase/TestClassesDataBase/camel-camel-2.23.1/CxfPayloadConsumerDuplicateNamespaceStreamCacheTest.txt

public class CxfPayloadConsumerDuplicateNamespaceStreamCacheTest extends CxfPayloadConsumerNamespaceOnEnvelopeStreamCacheTest {
  protected static final String REQUEST_MESSAGE="<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xs=\"http://www.w3.org/2001/XMLSchema\">" + "<soap:Body><ns2:getToken xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ns2=\"http://camel.apache.org/cxf/namespace\">" + "<arg0 xsi:type=\"xs:string\">Send</arg0></ns2:getToken></soap:Body></soap:Envelope>";
  @Test public void testInvokeRouter(){
    Object returnValue=template.requestBody("direct:router",REQUEST_MESSAGE);
    assertNotNull(returnValue);
    assertTrue(returnValue instanceof String);
    assertTrue(((String)returnValue).contains("Return Value"));
    assertTrue(((String)returnValue).contains("http://www.w3.org/2001/XMLSchema-instance"));
  }
}
